---
kind: type
id: T:Autodesk.Revit.DB.CurveArray
source: html/55103aad-38fd-45d2-6bf7-67a5203e99f3.htm
---
# Autodesk.Revit.DB.CurveArray

An array that can contain curves.

## Syntax (C#)
```csharp
public class CurveArray : APIObject, IEnumerable
```